{
  "metadata": {
    "total_size": 779149623808
  },
  "weight_map": {
    "model.embed_tokens.weight": "pytorch_model-00062-of-00080.bin",
    "model.layers.0.input_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.0.self_attn.query_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.0.self_attn.key_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.0.self_attn.o_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.0.post_attention_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.0.mlp.gate.wg.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.0.mlp.shared_mlp.up_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.0.mlp.shared_mlp.gate_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.0.mlp.shared_mlp.down_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.1.input_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.1.self_attn.q_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.1.self_attn.query_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.1.self_attn.key_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.1.self_attn.o_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.1.post_attention_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.1.mlp.gate.wg.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.1.mlp.shared_mlp.up_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.1.mlp.shared_mlp.gate_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.1.mlp.shared_mlp.down_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.8.input_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.8.self_attn.query_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.8.self_attn.key_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.8.self_attn.o_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.8.post_attention_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.8.mlp.gate.wg.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.8.mlp.shared_mlp.up_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.8.mlp.shared_mlp.gate_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.8.mlp.shared_mlp.down_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.9.input_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.9.self_attn.q_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.9.self_attn.query_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.9.self_attn.key_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.9.self_attn.o_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.9.post_attention_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.9.mlp.gate.wg.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.9.mlp.shared_mlp.up_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.9.mlp.shared_mlp.gate_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.9.mlp.shared_mlp.down_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.16.input_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.16.self_attn.query_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.16.self_attn.key_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.16.self_attn.o_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.16.post_attention_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.16.mlp.gate.wg.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.16.mlp.shared_mlp.up_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.16.mlp.shared_mlp.gate_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.16.mlp.shared_mlp.down_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.17.input_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.17.self_attn.q_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.17.self_attn.query_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.17.self_attn.key_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.17.self_attn.o_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.17.post_attention_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.17.mlp.gate.wg.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.17.mlp.shared_mlp.up_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.17.mlp.shared_mlp.gate_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.17.mlp.shared_mlp.down_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.24.input_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.24.self_attn.query_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.24.self_attn.key_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.24.self_attn.o_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.24.post_attention_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.24.mlp.gate.wg.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.24.mlp.shared_mlp.up_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.24.mlp.shared_mlp.gate_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.24.mlp.shared_mlp.down_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.25.input_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.25.self_attn.q_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.25.self_attn.query_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.25.self_attn.key_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.25.self_attn.o_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.25.post_attention_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.25.mlp.gate.wg.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.25.mlp.shared_mlp.up_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.25.mlp.shared_mlp.gate_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.25.mlp.shared_mlp.down_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.32.input_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.32.self_attn.query_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.32.self_attn.key_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.32.self_attn.o_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.32.post_attention_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.32.mlp.gate.wg.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.32.mlp.shared_mlp.up_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.32.mlp.shared_mlp.gate_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.32.mlp.shared_mlp.down_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.33.input_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.33.self_attn.q_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.33.self_attn.query_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.33.self_attn.key_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.33.self_attn.o_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.33.post_attention_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.33.mlp.gate.wg.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.33.mlp.shared_mlp.up_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.33.mlp.shared_mlp.gate_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.33.mlp.shared_mlp.down_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.40.input_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.40.self_attn.query_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.40.self_attn.key_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.40.self_attn.o_proj.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.40.post_attention_layernorm.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.40.mlp.gate.wg.weight": "pytorch_model-00001-of-00080.bin",
    "model.layers.40.mlp.shared_mlp.up_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.40.mlp.shared_mlp.gate_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.40.mlp.shared_mlp.down_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.41.input_layernorm.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.41.self_attn.q_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.41.self_attn.query_layernorm.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.41.self_attn.key_layernorm.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.41.self_attn.o_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.41.post_attention_layernorm.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.41.mlp.gate.wg.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.41.mlp.shared_mlp.up_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.41.mlp.shared_mlp.gate_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.41.mlp.shared_mlp.down_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.48.input_layernorm.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.48.self_attn.query_layernorm.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.48.self_attn.key_layernorm.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.48.self_attn.o_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.48.post_attention_layernorm.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.48.mlp.gate.wg.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.48.mlp.shared_mlp.up_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.48.mlp.shared_mlp.gate_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.48.mlp.shared_mlp.down_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.49.input_layernorm.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.49.self_attn.q_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.49.self_attn.query_layernorm.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.49.self_attn.key_layernorm.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.49.self_attn.o_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.49.post_attention_layernorm.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.49.mlp.gate.wg.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.49.mlp.shared_mlp.up_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.49.mlp.shared_mlp.gate_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.49.mlp.shared_mlp.down_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.56.input_layernorm.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.56.self_attn.query_layernorm.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.56.self_attn.key_layernorm.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.56.self_attn.o_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.56.post_attention_layernorm.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.56.mlp.gate.wg.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.56.mlp.shared_mlp.up_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.56.mlp.shared_mlp.gate_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.56.mlp.shared_mlp.down_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.57.input_layernorm.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.57.self_attn.q_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.57.self_attn.query_layernorm.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.57.self_attn.key_layernorm.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.57.self_attn.o_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.57.post_attention_layernorm.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.57.mlp.gate.wg.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.57.mlp.shared_mlp.up_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.57.mlp.shared_mlp.gate_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.57.mlp.shared_mlp.down_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.self_attn.o_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.shared_mlp.up_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.shared_mlp.gate_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.shared_mlp.down_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.1.self_attn.q_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.1.self_attn.o_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.1.mlp.shared_mlp.up_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.1.mlp.shared_mlp.gate_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.1.mlp.shared_mlp.down_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.8.self_attn.o_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.8.mlp.shared_mlp.up_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.8.mlp.shared_mlp.gate_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.8.mlp.shared_mlp.down_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.9.self_attn.q_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.9.self_attn.o_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.9.mlp.shared_mlp.up_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.9.mlp.shared_mlp.gate_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.9.mlp.shared_mlp.down_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.16.self_attn.o_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.16.mlp.shared_mlp.up_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.16.mlp.shared_mlp.gate_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.16.mlp.shared_mlp.down_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.17.self_attn.q_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.17.self_attn.o_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.17.mlp.shared_mlp.up_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.17.mlp.shared_mlp.gate_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.17.mlp.shared_mlp.down_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.24.self_attn.o_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.24.mlp.shared_mlp.up_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.24.mlp.shared_mlp.gate_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.24.mlp.shared_mlp.down_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.25.self_attn.q_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.25.self_attn.o_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.25.mlp.shared_mlp.up_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.25.mlp.shared_mlp.gate_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.25.mlp.shared_mlp.down_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.32.self_attn.o_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.32.mlp.shared_mlp.up_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.32.mlp.shared_mlp.gate_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.32.mlp.shared_mlp.down_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.33.self_attn.q_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.33.self_attn.o_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.33.mlp.shared_mlp.up_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.33.mlp.shared_mlp.gate_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.33.mlp.shared_mlp.down_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.40.self_attn.o_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.40.mlp.shared_mlp.up_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.40.mlp.shared_mlp.gate_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.40.mlp.shared_mlp.down_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.41.self_attn.q_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.41.self_attn.o_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.41.mlp.shared_mlp.up_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.41.mlp.shared_mlp.gate_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.41.mlp.shared_mlp.down_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.48.self_attn.o_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.48.mlp.shared_mlp.up_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.48.mlp.shared_mlp.gate_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.48.mlp.shared_mlp.down_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.49.self_attn.q_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.49.self_attn.o_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.49.mlp.shared_mlp.up_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.49.mlp.shared_mlp.gate_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.49.mlp.shared_mlp.down_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.56.self_attn.o_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.56.mlp.shared_mlp.up_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.56.mlp.shared_mlp.gate_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.56.mlp.shared_mlp.down_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.57.self_attn.q_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.57.self_attn.o_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.57.mlp.shared_mlp.up_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.57.mlp.shared_mlp.gate_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.57.mlp.shared_mlp.down_proj.bias": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.0.up_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.0.gate_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.0.down_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.1.up_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.1.gate_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.1.down_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.2.up_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.2.gate_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.2.down_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.3.up_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.3.gate_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.3.down_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.4.up_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.4.gate_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.4.down_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.5.up_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.5.gate_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.5.down_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.6.up_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.6.gate_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.6.down_proj.weight": "pytorch_model-00002-of-00080.bin",
    "model.layers.0.mlp.experts.7.up_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.7.gate_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.7.down_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.8.up_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.8.gate_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.8.down_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.9.up_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.9.gate_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.9.down_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.10.up_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.10.gate_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.10.down_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.11.up_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.11.gate_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.11.down_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.12.up_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.12.gate_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.12.down_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.13.up_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.13.gate_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.13.down_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.14.up_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.14.gate_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.14.down_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.15.up_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.15.gate_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.0.mlp.experts.15.down_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.1.mlp.experts.0.up_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.1.mlp.experts.0.gate_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.1.mlp.experts.0.down_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.1.mlp.experts.1.up_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.1.mlp.experts.1.gate_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.1.mlp.experts.1.down_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.1.mlp.experts.2.up_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.1.mlp.experts.2.gate_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.1.mlp.experts.2.down_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.1.mlp.experts.3.up_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.1.mlp.experts.3.gate_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.1.mlp.experts.3.down_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.1.mlp.experts.4.up_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.1.mlp.experts.4.gate_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.1.mlp.experts.4.down_proj.weight": "pytorch_model-00003-of-00080.bin",
    "model.layers.1.mlp.experts.5.up_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.5.gate_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.5.down_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.6.up_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.6.gate_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.6.down_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.7.up_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.7.gate_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.7.down_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.8.up_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.8.gate_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.8.down_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.9.up_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.9.gate_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.9.down_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.10.up_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.10.gate_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.10.down_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.11.up_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.11.gate_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.11.down_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.12.up_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.12.gate_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.12.down_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.13.up_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.13.gate_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.13.down_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.14.up_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.14.gate_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.14.down_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.15.up_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.15.gate_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.1.mlp.experts.15.down_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.8.mlp.experts.0.up_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.8.mlp.experts.0.gate_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.8.mlp.experts.0.down_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.8.mlp.experts.1.up_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.8.mlp.experts.1.gate_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.8.mlp.experts.1.down_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.8.mlp.experts.2.up_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.8.mlp.experts.2.gate_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.8.mlp.experts.2.down_proj.weight": "pytorch_model-00004-of-00080.bin",
    "model.layers.8.mlp.experts.3.up_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.3.gate_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.3.down_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.4.up_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.4.gate_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.4.down_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.5.up_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.5.gate_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.5.down_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.6.up_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.6.gate_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.6.down_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.7.up_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.7.gate_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.7.down_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.8.up_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.8.gate_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.8.down_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.9.up_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.9.gate_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.9.down_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.10.up_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.10.gate_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.10.down_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.11.up_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.11.gate_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.11.down_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.12.up_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.12.gate_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.12.down_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.13.up_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.13.gate_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.13.down_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.14.up_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.14.gate_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.14.down_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.15.up_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.15.gate_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.8.mlp.experts.15.down_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.9.mlp.experts.0.up_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.9.mlp.experts.0.gate_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.9.mlp.experts.0.down_proj.weight": "pytorch_model-00005-of-00080.bin",
    "model.layers.9.mlp.experts.1.up_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.1.gate_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.1.down_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.2.up_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.2.gate_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.2.down_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.3.up_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.3.gate_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.3.down_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.4.up_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.4.gate_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.4.down_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.5.up_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.5.gate_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.5.down_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.6.up_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.6.gate_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.6.down_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.7.up_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.7.gate_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.7.down_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.8.up_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.8.gate_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.8.down_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.9.up_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.9.gate_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.9.down_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.10.up_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.10.gate_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.10.down_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.11.up_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.11.gate_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.11.down_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.12.up_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.12.gate_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.12.down_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.13.up_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.13.gate_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.13.down_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.14.up_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.14.gate_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.14.down_proj.weight": "pytorch_model-00006-of-00080.bin",
    "model.layers.9.mlp.experts.15.up_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.9.mlp.experts.15.gate_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.9.mlp.experts.15.down_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.0.up_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.0.gate_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.0.down_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.1.up_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.1.gate_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.1.down_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.2.up_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.2.gate_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.2.down_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.3.up_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.3.gate_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.3.down_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.4.up_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.4.gate_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.4.down_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.5.up_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.5.gate_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.5.down_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.6.up_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.6.gate_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.6.down_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.7.up_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.7.gate_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.7.down_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.8.up_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.8.gate_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.8.down_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.9.up_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.9.gate_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.9.down_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.10.up_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.10.gate_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.10.down_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.11.up_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.11.gate_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.11.down_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.12.up_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.12.gate_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.12.down_proj.weight": "pytorch_model-00007-of-00080.bin",
    "model.layers.16.mlp.experts.13.up_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.16.mlp.experts.13.gate_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.16.mlp.experts.13.down_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.16.mlp.experts.14.up_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.16.mlp.experts.14.gate_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.16.mlp.experts.14.down_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.16.mlp.experts.15.up_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.16.mlp.experts.15.gate_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.16.mlp.experts.15.down_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.0.up_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.0.gate_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.0.down_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.1.up_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.1.gate_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.1.down_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.2.up_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.2.gate_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.2.down_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.3.up_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.3.gate_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.3.down_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.4.up_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.4.gate_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.4.down_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.5.up_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.5.gate_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.5.down_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.6.up_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.6.gate_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.6.down_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.7.up_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.7.gate_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.7.down_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.8.up_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.8.gate_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.8.down_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.9.up_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.9.gate_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.9.down_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.10.up_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.10.gate_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.10.down_proj.weight": "pytorch_model-00008-of-00080.bin",
    "model.layers.17.mlp.experts.11.up_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.17.mlp.experts.11.gate_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.17.mlp.experts.11.down_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.17.mlp.experts.12.up_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.17.mlp.experts.12.gate_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.17.mlp.experts.12.down_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.17.mlp.experts.13.up_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.17.mlp.experts.13.gate_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.17.mlp.experts.13.down_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.17.mlp.experts.14.up_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.17.mlp.experts.14.gate_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.17.mlp.experts.14.down_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.17.mlp.experts.15.up_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.17.mlp.experts.15.gate_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.17.mlp.experts.15.down_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.0.up_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.0.gate_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.0.down_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.1.up_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.1.gate_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.1.down_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.2.up_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.2.gate_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.2.down_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.3.up_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.3.gate_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.3.down_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.4.up_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.4.gate_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.4.down_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.5.up_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.5.gate_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.5.down_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.6.up_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.6.gate_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.6.down_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.7.up_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.7.gate_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.7.down_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.8.up_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.8.gate_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.8.down_proj.weight": "pytorch_model-00009-of-00080.bin",
    "model.layers.24.mlp.experts.9.up_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.24.mlp.experts.9.gate_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.24.mlp.experts.9.down_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.24.mlp.experts.10.up_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.24.mlp.experts.10.gate_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.24.mlp.experts.10.down_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.24.mlp.experts.11.up_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.24.mlp.experts.11.gate_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.24.mlp.experts.11.down_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.24.mlp.experts.12.up_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.24.mlp.experts.12.gate_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.24.mlp.experts.12.down_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.24.mlp.experts.13.up_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.24.mlp.experts.13.gate_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.24.mlp.experts.13.down_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.24.mlp.experts.14.up_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.24.mlp.experts.14.gate_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.24.mlp.experts.14.down_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.24.mlp.experts.15.up_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.24.mlp.experts.15.gate_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.24.mlp.experts.15.down_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.25.mlp.experts.0.up_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.25.mlp.experts.0.gate_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.25.mlp.experts.0.down_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.25.mlp.experts.1.up_proj.weight": "pytorch_model-00010-of-00080.bin",
    "model.layers.25.mlp.experts.1.gate_proj.weight": "pytorch_model-00010-of-00080.bin",
